In [1]:
import pandas as pd

In [4]:
data = pd.read_csv("../linear_Regression/Housing Price data set.csv")
data

,Unnamed: 0,price,lotsize,bedrooms,bathrms,stories,driveway,recroom,fullbase,gashw,airco,garagepl,prefarea
0,1,42000.0,5850,3,1,2,yes,no,yes,no,no,1,no
1,2,38500.0,4000,2,1,1,yes,no,no,no,no,0,no
2,3,49500.0,3060,3,1,1,yes,no,no,no,no,0,no
3,4,60500.0,6650,3,1,2,yes,yes,no,no,no,0,no
4,5,61000.0,6360,2,1,1,yes,no,no,no,no,0,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...
541,542,91500.0,4800,3,2,4,yes,yes,no,no,yes,0,no
542,543,94000.0,6000,3,2,4,yes,no,no,no,yes,0,no
543,544,103000.0,6000,3,2,4,yes,yes,no,no,yes,1,no
544,545,105000.0,6000,3,2,2,yes,yes,no,no,yes,1,no
545,546,105000.0,6000,3,1,2,yes,no,no,no,yes,1,no

In [6]:
power_data = {
    'shinobi':["naruto","sasuke","itachi","pain","madara","hashirama","minato"],
    'power':[1000000,1000000000000,10000,70000,100000000,1000000,5000000],
    'rank':["planetary","universal","SSS","SSS","universal","planetary","planetary"]
}
df = pd.DataFrame(power_data)
df

     shinobi          power       rank
0     naruto        1000000  planetary
1     sasuke  1000000000000  universal
2     itachi          10000        SSS
3       pain          70000        SSS
4     madara      100000000  universal
5  hashirama        1000000  planetary
6     minato        5000000  planetary

In [7]:
df.shape

(7, 3)

In [9]:
rows,columns = df.shape  # for storing no of rows and columns 
print(rows)
print(columns)

7
3

In [10]:
df.head()

  shinobi          power       rank
0  naruto        1000000  planetary
1  sasuke  1000000000000  universal
2  itachi          10000        SSS
3    pain          70000        SSS
4  madara      100000000  universal

In [11]:
df.tail()

     shinobi      power       rank
2     itachi      10000        SSS
3       pain      70000        SSS
4     madara  100000000  universal
5  hashirama    1000000  planetary
6     minato    5000000  planetary

In [12]:
df[2:5]

  shinobi      power       rank
2  itachi      10000        SSS
3    pain      70000        SSS
4  madara  100000000  universal

In [13]:
df['shinobi'] # accesing columns

0       naruto
1       sasuke
2       itachi
3         pain
4       madara
5    hashirama
6       minato
Name: shinobi, dtype: object

In [14]:
df.columns

Index(['shinobi', 'power', 'rank'], dtype='object')

In [15]:
df.power # accesing columns

0          1000000
1    1000000000000
2            10000
3            70000
4        100000000
5          1000000
6          5000000
Name: power, dtype: int64

In [17]:
type(df)

pandas.core.frame.DataFrame

In [18]:
df[['shinobi','rank']] # printing only certain columns

     shinobi       rank
0     naruto  planetary
1     sasuke  universal
2     itachi        SSS
3       pain        SSS
4     madara  universal
5  hashirama  planetary
6     minato  planetary

In [19]:
df['power'].max()

1000000000000

In [20]:
df['power'].min()

10000

In [21]:
df['power'].mean()

142872440000.0

In [23]:
df['power'].std()

377957729392.7038

In [24]:
df.describe()

              power
count  7.000000e+00
mean   1.428724e+11
std    3.779577e+11
min    1.000000e+04
25%    5.350000e+05
50%    1.000000e+06
75%    5.250000e+07
max    1.000000e+12

conditionally selecting data

In [25]:
df[df.power>=100000000]

  shinobi          power       rank
1  sasuke  1000000000000  universal
4  madara      100000000  universal

In [26]:
df[df.power==df.power.max()]

  shinobi          power       rank
1  sasuke  1000000000000  universal

In [27]:
df[['shinobi','rank']][df.power>=10000000]  # selecting only few columns from returing dataset

  shinobi       rank
1  sasuke  universal
4  madara  universal

In [28]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [30]:
# df.set_index('power') setting power column for indexing 
df[0:1]

  shinobi    power       rank
0  naruto  1000000  planetary

In [33]:
df.loc[1]

shinobi           sasuke
power      1000000000000
rank           universal
Name: 1, dtype: object